{"14711107":"Consolidated purchase power for amazing vacations","6c9fbbe0":"INVESTMENTS","-7b20a940":"THE FOUNDER","253fd2be":"CONTACT US","72ac54bd":"SCROLL TO DISCOVER ME","4b8061da":"#1 NICE TO MEET YOU","248d2132":"Hey, I'm YOLM LLC and you obviously love me because as an investment firm, I've made promising smart investments that will bring smiles to my partners' faces in the future. ","77e609db":"My current brightest investments are the two below.","-2641c251":"#2 INVESTMENTS","18b160f0":"A credit card that makes its users wealthy","-4938d732":"A fintech working on an epic credit card for the zoomer generation. Feedback from influencers so far gives the company's three founders confidence that this can be a disruptive financial app and credit card. Snøbol has the potential to change the lives of millions of young Americans through a better personal finance future.","-296645b3":"/snobol.com","-453d8388":"The company started consolidating purchasing power in the tiny northern European countries of Estonia and Finland. WOWW was the fastest growing company in the sector for several consecutive years. The unwavering love of users gave the company's founder the confidence to expand the concept to the US market as well. ","-4066345c":"The future looks exciting for the WOWW!","43c3f77a":"/woww.com","-265e8ea2":"#3 ABOUT MY FOUNDER","b5fa694":"Originally from Tallinn, Estonia, Kristian Kuutok has developed B2C startup companies in the markets of Estonia, Finland, Sweden and Latvia throughout his adult life. ","71e65e20":"From 2021, he resides in the US. Kristian has been fortunate to be part of two fast-growing startup success stories as a founder, as well as to work as a fund manager that consistently outperforms the S&P 500. Kristian has created a unique investment guide Black Snowball Strategy™. He loves Seattle, WA but his heart also belongs to the quiet little home island of Ormsö, Estland.","63d4f8b6":"Kristian believes that simplicity is an art form.","-2566ed4e":"\"Go confidently in the direction of your dreams! Live the life you've imagined. As you simplify your life, the laws of the universe will be simpler.\" — Henry David Thoreau","5b26e8fb":"#4 ENJOYING THE GAME","-7f888298":"Finally, life as a company is quite nice, but instead of blood circulation, I have a balance sheet. Nothing makes me happier than competent, ambitious and enthusiastically innovating teams - because their honest and brave actions are later followed by fascinating numbers.","-2c80961f":"Everything most important is invisible to the eye at first glance. That, to me, is the magic of the game.","-35a8a8f2":"Sincerely yours, ","2a2337":"Yolm","-63ec39bd":"© 2024 Yolm LLC","-55a04454":"999 Third Ave Seattle, WA 98104","-502fd628":"hello@yolm.com"}